import { describe, test, expect } from 'vitest';
import { pluralizeUk } from '@site/src/lib/i18n/plural';

describe('pluralizeUk with forms', () => {
  const forms: [string, string, string] = ['форма', 'форми', 'форм'];

  test.each([
    [1, 'форма'],
    [21, 'форма'],
    [101, 'форма'],
    [2, 'форми'],
    [4, 'форми'],
    [22, 'форми'],
    [32, 'форми'],
    [0, 'форм'],
    [5, 'форм'],
    [11, 'форм'],
    [12, 'форм'],
    [14, 'форм'],
    [25, 'форм'],
    [100, 'форм'],
    [111, 'форм'],
    [112, 'форм'],
  ])('n = %i maps to "%s"', (n, expected) => {
    expect(pluralizeUk(n, forms)).toBe(expected);
  });
});

describe('pluralizeUk with marked forms', () => {
  const forms: [string, string, string] = ['маркована форма', 'марковані форми', 'маркованих форм'];

  test.each([
    [1, 'маркована форма'],
    [21, 'маркована форма'],
    [101, 'маркована форма'],
    [2, 'марковані форми'],
    [4, 'марковані форми'],
    [22, 'марковані форми'],
    [32, 'марковані форми'],
    [0, 'маркованих форм'],
    [5, 'маркованих форм'],
    [11, 'маркованих форм'],
    [12, 'маркованих форм'],
    [14, 'маркованих форм'],
    [25, 'маркованих форм'],
    [100, 'маркованих форм'],
    [111, 'маркованих форм'],
    [112, 'маркованих форм'],
  ])('n = %i maps to "%s"', (n, expected) => {
    expect(pluralizeUk(n, forms)).toBe(expected);
  });
});
